# Xiaoyue Zhu

# SELECTing multiple columns
In the real world, you will often want to select multiple columns. Luckily, SQL makes this really easy. To select multiple columns from a table, simply separate the column names with commas!

For example, this query selects two columns, name and birthdate, from the people table:

SELECT name, birthdate
FROM people;
Sometimes, you may want to select all columns from a table. Typing out every column name would be a pain, so there's a handy shortcut:

SELECT *
FROM people;
If you only want to return a certain number of results, you can use the LIMIT keyword to limit the number of rows returned:

SELECT *
FROM people
LIMIT 10;
Before getting started with the instructions below, check out the column names in the films table!

# SELECT DISTINCT
Often your results will include many duplicate values. If you want to select all the unique values from a column, you can use the DISTINCT keyword.

This might be useful if, for example, you're interested in knowing which languages are represented in the films table:

SELECT DISTINCT language
FROM films;
Remember, you can check out the data in the tables by clicking on the table name!

e.g. Get all the different film certifications from the films table.

SELECT DISTINCT certification

FROM films;

e.g. Get the different types of film roles from the roles table.

SELECT DISTINCT role

FROM roles;

# Simple filtering of text
The WHERE clause can also be used to filter text results, such as names or countries.

For example, this query gets the titles of all films which were filmed in China:

SELECT title
FROM films
WHERE country = 'China';
Now it's your turn to practice using WHERE with text values!

Important: in PostgreSQL (the version of SQL we're using), you must use single quotes with WHERE.

e.g. Get the name and birth date of the person born on November 11th, 1974. Remember to use ISO date format ('1974-11-11')!


SELECT name, birthdate

FROM people

WHERE birthdate = '1974-11-11';

# WHERE AND
Often, you'll want to select data based on multiple conditions. You can build up your WHERE queries by combining multiple conditions with the AND keyword.

For example,

SELECT title
FROM films
WHERE release_year > 1994
AND release_year < 2000;
gives you the titles of films released between 1994 and 2000.

Note that you need to specify the column name separately for every AND condition, so the following would be invalid:

SELECT title
FROM films
WHERE release_year > 1994 AND < 2000;
You can add as many AND conditions as you need!

e.g. Get the title and release year for all Spanish language films released before 2000.

SELECT title, release_year

FROM films

WHERE release_year < 2000

AND language = 'Spanish';

# Combining aggregate functions with WHERE
Aggregate functions can be combined with the WHERE clause to gain further insights from your data.

For example, to get the total budget of movies made in the year 2010 or later:

SELECT SUM(budget)
FROM films
WHERE release_year >= 2010;
Now it's your turn!

Instructions 1/4

e.g.Use the SUM() function to get the total amount grossed by all films made in the year 2000 or later.

SELECT SUM(gross)

FROM films

WHERE release_year >= 2000;

e.g.Get the average amount grossed by all films whose titles start with the letter 'A'.

SELECT AVG(gross)

FROM films

where title LIKE 'A%';

e.g. Get the amount grossed by the worst performing film in 1994.

SELECT MIN(gross)

FROM films

WHERE release_year = 1994;

# Even more aliasing
Let's practice your newfound aliasing skills some more before moving on!

Recall: SQL assumes that if you divide an integer by an integer, you want to get an integer back.

This means that the following will erroneously result in 400.0:

SELECT 45 / 10 * 100.0;
This is because 45 / 10 evaluates to an integer (4), and not a decimal number like we would expect.

So when you're dividing make sure at least one of your numbers has a decimal place:

SELECT 45 * 100.0 / 10;
The above now gives the correct answer of 450.0 since the numerator (45 * 100.0) of the division is now a decimal!

e.g. Get the percentage of people who are no longer alive. Alias the result as percentage_dead. Remember to use 100.0 and not 100!

-- get the count(deathdate) and multiply by 100.0

-- then divide by count(*) 

SELECT COUNT(deathdate) * 100.0 / COUNT(*) AS percentage_dead

FROM people;

e.g. Get the number of years between the newest film and oldest film. Alias the result as difference.

SELECT MAX(release_year) - MIN(release_year)

AS difference

FROM films;

e.g. Get the number of decades the films table covers. Alias the result as number_of_decades. The top half of your fraction should be enclosed in parentheses.

SELECT (MAX(release_year) - MIN(release_year)) / 10.0

AS number_of_decades

FROM films;

# Sorting single columns
Now that you understand how ORDER BY works, give these exercises a go!

e.g. Get the names of people from the people table, sorted alphabetically.

SELECT name

FROM people

ORDER BY name;

e.g

# All Together

Get the country, average budget, and average gross take of countries that have made more than 10 films. Order the result by country name, and limit the number of results displayed to 5. You should alias the averages as avg_budget and avg_gross respectively.

-- select country, average budget, 
--     and average gross

-- from the films table

-- group by country 

-- where the country has more than 10 titles

-- order by country

-- limit to only show 5 results